Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: This is useful for representing Unicode strings, and for comparing version "numbers" using the string comparison operators, C<cmp>, C<gt>, C<lt> etc. If there are two or more dots in the literal, the leading C<v> may be omitted.
es: Esto es útil para la representación de cadenas Unicode, y para comparar los "números" de versión que utilizan los operadores de comparación de cadenas, C<cmp>, C<gt>, C<lt>, etc. Si hay dos o más puntos en el literal, se puede omitir el prefijo C<v>.

source: This is useful for throwing away some of the return values of a function:
es: Esto es útil para descartar algunos de los valores devueltos por una función:

source: This is useful if you want to put object initialization in its own separate method:
es: Esto es útil si desea inicializar el objeto en un método independiente:

source: This is useful when the changes are more complex than the sample given here, and, depending on the editor, to know that the first line of the commit message doesn't exceed the 50 character legal maximum.
es: Esto resulta útil cuando los cambios son más complejos que los mostrados aquí como ejemplo y, en función del editor utilizado, debe tener en cuenta que la primera línea del mensaje de confirmación no debe superar la longitud máxima admitida de 50 caracteres.

source: This is usually 32766 on the most common platforms.
es: Normalmente, este límite es 32766 para la mayoría de las plataformas.

source: This is what C<(.+)+> is doing, and C<(.+)+> is similar to a subpattern of the above pattern.
es: Esto es lo que hace C<(.+)+>, y C<(.+)+> es similar a un subpatrón del patrón mostrado arriba.

source: This is where roles come in.
es: Aquí es donde entran en juego los roles.

source: This isn't supposed to happen.
es: Se supone que esto no debe de ocurrir.

source: This isn't the same as a constant subroutine, which is subject to optimization at compile-time.
es: Esto no es lo mismo que una subrutina constante, que está sujeta a optimización en tiempo de compilación.

source: This lets you ask questions like "what methods does the File class implement?" It also lets you modify your classes programmatically.
es: Esto permite contestar a preguntas como "¿qué métodos implementa la clase Archivo?". También permite modificar las clases mediante programación.

source: This lets you describe I<what> your class is, rather than having to tell Perl I<how> to implement your class.
es: Esto permite describir I<qué> es la clase, en lugar de tener que decir a Perl I<cómo> implementar la clase.

source: This load time hit can be a problem when startup speed is important, such as with a command-line script or a "plain vanilla" CGI script that must be loaded each time it is executed.
es: Este incremento en el tiempo de carga puede ser problemático cuando la velocidad de inicio es importante, como en scripts de línea de comandos o en el típico script CGI que debe cargarse cada vez que se ejecuta.

source: This makes it easy to write loops that terminate when a null list is returned:
es: Esto facilita la escritura de bucles que terminan cuando se devuelve una lista vacía:

source: This makes it nice for initializing hashes:
es: Este operador es cómodo para inicializar un hash:

source: This makes you write programs that don't just react to your needs, but actually anticipate them.
es: Esta cualidad le permite escribir programas que no solo reaccionarán a sus necesidades, sino que se anticiparán a ellas.

source: This matches the same substring as a standalone C<a+>, and the following C<\g{-1}> eats the matched string; it therefore makes a zero-length assertion into an analogue of C<< (?>...) >>.
es: Esto coincide con la misma subcadena que un patrón C<a+> independiente, y el siguiente C<\g{-1}> consume la cadena coincidente; por lo tanto, hace una aserción de longitud cero, como un análogo de C<< (?>...) >>.

source: This may be a problem because now we're looking in C<SharedGreatGrandParent> I<before> we've checked all its derived classes (i.e. before we tried C<Mother> and C<MaternalGrandparent>).
es: Esto puede ser problemático porque ahora se busca en C<BisabueloComún> I<antes> de buscar en todas sus clases derivadas (es decir, antes de intentar la búsqueda en C<Madre> y C<AbueloMaterno>).

source: This may be faster, but it probably won't look as nice.
es: Puede que sea más rápido, pero es probable que el aspecto del resultado sea peor.

source: This may be useful in a subroutine that gets passed typeglobs as arguments:
es: Esto puede ser útil en una subrutina que recibe I<typeglobs> como argumentos:

source: This may be useful if the docs don't explain a function in the detail you need, and you'd like to inspect the code directly; perldoc will find the file for you and simply hand it off for display.
es: Esto puede resultar útil si en la documentación no se explica una función con el nivel de detalle necesario y desea inspeccionar el código directamente; perldoc buscará el archivo y se lo mostrará.

source: This may be useful in a my() or local().
es: Esto puede ser útil para my() o local().

source: This may not be the same as the compilation-time locale, and can differ from one match to another if there is an intervening call of the L<setlocale() function|perllocale/The setlocale function>.
es: Puede no ser la misma que la configuración regional en tiempo de compilación y puede variar de una coincidencia a otra, si hay una llamada a la L<función setlocale()|perllocale/La función setlocale>.

source: This may seem a bit weird, but that's okay, because it is weird.
es: Esto puede parecerle un poco raro, pero no debe preocuparse: es raro.

source: This may substantially slow your program.
es: Esto puede ralentizar considerablemente el programa.

source: This means for example that C<$version{2.0}++> is equivalent to C<$version{2}++>, not to C<$version{'2.0'}++>.
es: Esto significa, por ejemplo, que C<$version{2.0}++> es equivalente a C<$version{2}++>, no a C<$version{'2.0'}++>.

source: This means that $foo and @foo are two different variables.
es: Esto quiere decir que $foo y @foo son dos variables distintas.

source: This means that a class must implement its own constructor.
es: Esto significa que una clase debe implementar su propio constructor.

source: This means that alternatives are not necessarily greedy.
es: Esto significa que las alternativas no son necesariamente avariciosas.

source: This means that any objects contained by your object may already have been destroyed.
es: Esto significa que es posible que se destruyan antes los objetos contenidos en su objeto.

source: This means that code points above 255 are treated as Unicode no matter what locale is in effect.
es: Esto significa que los códigos de carácter por encima de 255 se consideran como Unicode, independientemente de la configuración regional que esté en vigor.

source: This means that programmers need new habits.
es: Esto significa que los programadores deben adquirir nuevas costumbres.

source: This means that the branches within can not be rebased and pushed as a single step.
es: Esto significa que las ramas que contiene no se pueden reorganizar y enviar en un solo paso.

source: This means that the following code:
es: Esto se puede ver en el siguiente ejemplo de código:

source: This means that we can try to call the C<print_content()> method on an object of either class, and B<we don't have to know what class the object belongs to!>
es: Esto significa que podemos intentar llamar al método C<imprimir_contenido()> desde un objeto de cualquiera de estas clases B<sin saber a qué clase pertenece el objeto>.

source: This means that you can, without fear of conflict, use the same name for a scalar variable, an array, or a hash--or, for that matter, for a filehandle, a directory handle, a subroutine name, a format name, or a label.
es: Esto significa que se puede utilizar el mismo nombre para una variable escalar, un array o un hash sin que se produzcan conflictos; o, por la misma razón, se puede utilizar el mismo nombre para un identificador de archivo, un identificador de directorio, el nombre de una subrutina, un nombre de formato o una etiqueta.

source: This means there is a possibility that the optree will outlive the particular thread (and therefore the interpreter instance) that created it, so true Perl scalars cannot be stored in the optree.
es: Esto significa que existe la posibilidad de que el árbol sintáctico de operaciones sobreviva al hilo de ejecución (y, por tanto, a la instancia del intérprete) que lo creó, por lo que no se pueden almacenar escalares auténticos de Perl en dicho árbol.

source: This means writing a bit pattern into it that should be illegal as pointers (and floating point numbers), and also hopefully surprising enough as integers, so that any code attempting to use the data without forethought will break sooner rather than later.
es: El envenenamiento de datos consiste en escribir en los datos un patrón de bits que no que sean válidos como punteros (ni como números de punto flotante), ni (esperamos que de forma sorprendente) como enteros, a fin de que todo código que intente usar los datos sin la preparación necesaria genere un error cuanto antes.

source: This means you can change that implementation without breaking the API.
es: Esto significa que se puede cambiar la implementación sin cambiar la API.

source: This method is provided for use by object system extensions that implement roles, like C<Moose> and C<Role::Tiny>.
es: Este método se proporciona para su uso con extensiones del sistema de objetos que implementan roles, como C<Moose> y C<Role::Tiny>.

source: This method will always be called by Perl at the appropriate time, unless the method is empty.
es: Perl siempre llamará a este método cuando sea necesario, a menos que esté vacío.

source: This minimalism made a lot of sense in 1994, but in the years since Perl 5.0 we've seen a number of common patterns emerge in Perl OO.
es: Este minimalismo tenía sentido en 1994, pero en los años que han transcurrido desde que se lanzó Perl 5.0 han surgido diversos patrones comunes en la orientación a objetos de Perl.

source: This modifier is automatically selected by default when none of the others are, so yet another name for it is "Default".
es: Este modificador se selecciona automáticamente de forma predeterminada si ninguno de los demás están presentes, por lo que también se conoce como el modificador "por Defecto" (predeterminado).

source: This modifier is useful for people who only incidentally use Unicode, and who do not wish to be burdened with its complexities and security concerns.
es: Este modificador es útil para personas que solo usan Unicode ocasionalmente y para quienes no deseen enfrentarse a su complejidad y sus problemas de seguridad.

source: This modifier may be specified to be the default by C<use feature 'unicode_strings>, C<use locale ':not_characters'>, or C<L<use 5.012|perlfunc/use VERSION>> (or higher), but see L</Which character set modifier is in effect?>.
es: Se puede especificar este modificador como predeterminado por medio de C<use feature 'unicode_strings'>, C<use locale ':not_characters'> o C<L<use 5.012|perlfunc/use VERSION>> (o superior), pero vea L</¿Qué modificador de juego de caracteres está en vigor?>.

source: This modifier may be specified to be the default by C<use locale>, but see L</Which character set modifier is in effect?>.
es: Se puede especificar este modificador como el predeterminado mediante C<use locale>, pero vea L</¿Qué modificador de juego de caracteres está en vigor?>.

source: This modifier may be specified to be the default by C<use re '/a'> or C<use re '/aa'>.
es: Se puede especificar este modificador como predeterminado mediante C<use re '/a'> o C<use re '/aa'>.

source: This modifier means to use the "Default" native rules of the platform except when there is cause to use Unicode rules instead, as follows:
es: Este modificador hace que se usen las reglas nativas "predeterminadas" (por I<d>efecto) de la plataforma, excepto cuando hay razones para usar las reglas de Unicode, de la siguiente manera:

source: This modifier stands for ASCII-restrict (or ASCII-safe).
es: A este modificador se le conoce como ASCII-restrictivo (o ASCII-seguro).

source: This modifier, unlike the others, may be doubled-up to increase its effect.
es: A diferencia de los demás modificadores, se puede duplicar para aumentar su efecto.

source: This module truly lives up to its name.
es: Este módulo se ajusta realmente a su nombre.

source: This module was added to the core to support inside-out object implementations.
es: Este módulo se agregó al núcleo para permitir implementaciones de objetos I<inside-out>.

source: This name is listed in a L</directory>, and you can use it in an L<open|perlfunc/open> to tell the L</operating system> exactly which file you want to open, and associate the file with a L</filehandle> which will carry the subsequent identity of that file in your program, until you close it.
es: Este nombre se muestra en un L</directorio> y puede usarlo en una función L<open|perlfunc/open> para indicar al L</sistema operativo> exactamente qué archivo desea abrir, y asociar el archivo a un L</identificador de archivo> que asumirá la identidad de ese archivo en el programa hasta que lo cierre.

source: This page describes the syntax of regular expressions in Perl.
es: En esta página se describe la sintaxis de las expresiones regulares en Perl.

source: This pattern matches nothing and always fails.
es: Este patrón no coincide con nada y siempre produce un error de coincidencia.

source: This pattern matches nothing and causes the end of successful matching at the point at which the C<(*ACCEPT)> pattern was encountered, regardless of whether there is actually more to match in the string.
es: Este patrón no coincide con nada y provoca el final de una coincidencia correcta en el lugar en que se detecta el patrón C<(*ACCEPT)>, independientemente de que haya más coincidencias en la cadena.

source: This poses a problem for content such as book lists.
es: Esto supone un problema para mantener una lista de libros actualizada.

source: This pragma has precedence over the other pragmas listed below that also change the defaults.
es: Este pragma tiene precedencia sobre otros pragmas que se muestran a continuación, que también cambian los valores predeterminados.

source: This pragma lets you switch to the "C3" resolution order.
es: Este pragma permite cambiar al orden de resolución "C3".

source: This pragma will take care of setting C<@ISA>.
es: Este pragma se ocupará de establecer C<@ISA>.

source: This prints
es: Esto imprime

source: This program provides an easy way to send a thank-you message back to the authors and maintainers of perl.
es: Este programa proporciona una manera sencilla de enviar un mensaje de agradecimiento a las personas que se encargan de desarrollar y mantener perl.

source: This prohibition interacts with backtracking (see L<"Backtracking">), and so the I<second best> match is chosen if the I<best> match is of zero length.
es: Esta prohibición interactúa con la vuelta atrás (vea L<"Vuelta atrás">), por lo que se elige la I<segunda mejor> coincidencia si la I<mejor> coincidencia es de longitud cero.

source: This provides a simple mechanism for making a module threadsafe; just add C<sub CLONE_SKIP { 1 }> at the top of the class, and C<DESTROY()> will now only be called once per object.
es: Esto proporciona un mecanismo sencillo para hacer que los hilos de ejecución de los módulos sean seguros; basta con agregar C<sub CLONE_SKIP { 1 }> al comienzo de la clase y se llamará a C<DESTROY()> una sola vez por cada objeto.

source: This restriction is due to the wide-spread and remarkably convenient custom of using run-time determined strings as patterns.
es: Esta restricción se debe a la costumbre, muy extendida y bastante cómoda, de usar como patrones cadenas determinadas en tiempo de ejecución.

source: This results in checking out the median commit between C<HEAD> and C<perl-5.10.0>.
es: Esto hace que se obtenga la confirmación intermedia entre C<HEAD> y C<perl-5.10.0>.

source: This role would define a known API like providing C<turn_on()> and C<turn_off()> methods.
es: Este rol podría definir una interfaz conocida con los métodos C<encender()> y C<apagar()>.

source: This rounds up the allocated buckets to the next power of two:
es: Esto redondea el número de casillas reservadas a la siguiente potencia de dos:

source: This script was primarily a technology demonstrator for Perl 5.8.0, but you can use piconv in the place of iconv for virtually any case.
es: Este script se desarrolló simplemente como una demostración de tecnología para Perl 5.8.0, pero puede usar piconv para cualquier tarea para la que usaría iconv.

source: This section describes the notion of better/worse for combining operators.
es: En esta sección se describe el concepto de mejor/peor para los operadores de combinación.

source: This section needs a rewrite.
es: Esta sección debería reescribirse.

source: This section of the FAQ answers questions about where to find source and documentation for Perl, support, and related matters.
es: En esta sección de preguntas más frecuentes se indica dónde se puede obtener el código fuente y la documentación de Perl, cómo obtener soporte técnico, y se incluye información sobre otros temas relacionados.

source: This section of the FAQ answers very general, high-level questions about Perl.
es: En esta sección de las preguntas más frecuentes se proporcionan respuestas a preguntas muy generales sobre Perl.

source: This shows that there were changes to this document staged for commit, and that there were further changes in the working directory not yet staged.
es: Indica que los cambios realizados a este documento se han preparado y están pendientes de confirmación, y que en el directorio de trabajo hay más cambios que aún no están preparados.

source: This silent implicit decoding is known as "upgrading".
es: Se produce una descodificación implícita sin aviso, denominada "promoción".

source: This specifies an option to call the formatter B<w>ith.
es: Permite especificar una opción con ("w" viene de la palabra inglesa B<w>ith) la que desea llamar al formateador.

source: This specifies that the output is not to be sent to a pager, but is to be sent right to STDOUT.
es: Especifica que la salida no se enviará a un paginador; se enviará directamente a STDOUT.

source: This specifies that the output is to be sent neither to a pager nor to STDOUT, but is to be saved to the specified filename.
es: Especifica que la salida no se enviará a un paginador ni a STDOUT; se guardará en un archivo con el nombre especificado.

source: This specifies that you want Perldoc to try using a Pod-formatting class for the output format that you specify.
es: Especifica que perldoc debe intentar usar una clase de formato pod para el formato de salida indicado.

source: This specifies the module that you want to try using for formatting the pod.
es: Permite especificar el módulo que se desea usar para aplicar formato al código pod.

source: This subroutine returns an object's class when passed an object, and false otherwise.
es: Esta subrutina devuelve la clase del objeto cuando se le pasa un objeto como argumento, y falso en cualquier otro caso.

source: This substitutes the question of "what is chosen?" by the question of "which matches are better, and which are worse?".
es: Esto sustituye la pregunta "¿qué se elige?" por "¿cuáles son las mejores coincidencias y cuáles son las peores?".

source: This syntax can be used with any class or object method:
es: Se puede usar con cualquier clase o método:

source: This syntax is called "indirect" because the method comes before the object it is being invoked on.
es: Esta sintaxis se denomina "indirecta" porque el método aparece antes que el objeto en el que se hace la llamada.

source: This technique was popular for a while (and was recommended in Damian Conway's I<Perl Best Practices>), but never achieved universal adoption.
es: Esta técnica se popularizó durante un tiempo (y se recomendó en el libro I<Perl Best Practices> de Damian Conway), aunque no se llegó a adoptar de forma universal.

source: This tells C<Moose> that this attribute must be a boolean value.
es: Esto le dice a C<Moose> que este atributo debe ser un valor booleano.

source: This time it goes all the way until the next occurrence of "foo".
es: Esta vez recorre todo el camino hasta la siguiente instancia de "come".

source: This time only two filters have been used; we only need to manipulate the contents of the key, so it wasn't necessary to install any value filters.
es: En este caso no se han utilizado más que dos filtros; solo hay que manipular el contenido de la clave, por lo que no es necesario instalar ningún filtro de valores.

source: This tutorial speaks in rather absolute terms, and provides only a limited view of the wealth of character string related features that Perl has to offer.
es: En este tutorial hablamos en términos absolutos, y solo proporcionamos una visión limitada de las muchas características relacionadas con el procesamiento de cadenas de caracteres que Perl ofrece.

source: This used to be the preferred way to pass arrays and hashes by reference into a function, but now that we have real references, this is seldom needed.
es: En el pasado, esta era la forma preferida de pasar arrays y hashes por referencia a una función, pero como ahora tenemos referencias de verdad, ya no se suele usar un typeglob para este fin.

source: This uses C<caller()> to determine the value of C<$^H{"myint/in_effect"}> when each line of the user's script was called, and therefore provide the correct semantics in the subroutine implementing the overloaded addition.
es: La rutina usa C<caller()> para determinar el valor que tenía C<$^H{"entero/in_effect"}> cuando se llamó a cada línea del script del usuario y, por tanto, proporcionar la semántica correcta en la subrutina que implementa la suma sobrecargada.

source: This uses the git protocol (port 9418).
es: Este comando usa el protocolo git (puerto 9418).

source: This utility, that comes with the C<Digest::SHA> module, is used to print or verify SHA checksums.
es: Esta utilidad, que se incluye con el módulo C<Digest::SHA>, se usa para imprimir o comprobar sumas de control SHA.

source: This value is placed in the special variable C<$?>.
es: Este valor se coloca en la variable especial C<$?>.

source: This view may conflict with other information that you may have found on the web, but that's mostly because many sources are wrong.
es: Nuestro enfoque puede chocar con otros que haya encontrado en Internet, pero esto se debe a que la información proporcionada por muchas fuentes no es correcta.

source: This was once used in a common idiom to disable or quote the special meanings of regular expression metacharacters in a string that you want to use for a pattern.
es: Esto se usaba como un modismo común para deshabilitar los significados especiales de los metacaracteres de expresiones regulares en una cadena que se desea utilizar para un patrón.

source: This was only 4 times slower on a string with 1000000 C<a>s.
es: Esto solo tarda 4 veces más en una cadena con un 1 000 000 de letras C<a>.

source: This way, you can define a set of regular expression rules that can be bundled into any pattern you choose.
es: De esta manera, puede definir un conjunto de reglas de expresiones regulares y agruparlas en cualquier patrón que elija.
